#include <iostream>

int main() 
{

int variable = 10; //создаем переменную типа int внутри функции main и присвоим ей значение. int = 4 байта, или 32 бита. (1 байт = 8 бит) Размер может отличатся, это зависит от архитектруры процессора и компилятора.
//
// std :: cout << "Hello! I'm your first program! "<< std :: endl;


std :: cout << variable << std :: endl; // здесь я заменил символьную строку на переменную и вывел значение переменной в консоль.
//теперь попробуем изменить значение нашей переменной
variable = 20;
std :: cout << variable << std :: endl; 
//сначала в коноле выведем значение 10, а потом 20.
std :: cin.get ();


}