#include <iostream>


//log функция, я её здесь разместил специально отдельным файлом .cpp


//теперь после того как я разместил мою log функцию отдельным файлом у меня math не видет её, и выдаст ошибку комплиляции, чтобы это решить я возьму первую строку функции которая является сигнатурой и добавлю её в math чтобы у меня было объявление функции log в math
void Log( const char* message) {     
    
     //2.создал ф-цию Log вместо cout которая принимает строку как параметр и выведем сообщение в консоль
//  3.const char*  - это у нас тип данных который может содержать строку текста


    std::cout << message << std::endl;
}