/* 

Указатель — это переменная, которая хранит адрес другой переменной.

int x = 5; //обычная переменная....число, которое лежит в памяти.
int* ptr = &x; // адрес, где лежит x, а не само число 5.


Оператор & — адрес
int a = 10;
int* ptr = &a;

//&a — адрес в памяти, где хранится a
//ptr — указатель, который хранит этот адрес
//& — “взять адрес”

Оператор * — разыменование...

int value = *ptr;

взять адрес из ptr
перейти по этому адресу
получить значение, которое там лежит
 *ptr — это как “идти по карте к дому”
 ptr — это сама карта

























*/